In [1]:
#Pandas is an opensource library built on top of NumPy used in Data Cleaning and Data Analysis , it also has visualisation
# tools and it works with Data forms and different sourcces 
# ............ HOW to INSTALL PANDAS .............
#       conda install pandas

In [2]:
#Series are main datatypes, they are very similar to Arrays in NumPy but the difference is that series have the index:
import numpy as np
import pandas as pd

In [3]:
#The following we define different Data containers to show you how we can define a Serie and study the differences

In [4]:
char = ['a','b','c']
num = [11,12,13]
arr= np.array(num)
arr

array([11, 12, 13])

In [5]:
dictionary = {'a':11,'b':12,'c':13}
#by shift + tab you can see what are the parameters of Series as well as Index
pd.Series(data=num)

0    11
1    12
2    13
dtype: int64

In [6]:
pd.Series(data=num , index=char)

a    11
b    12
c    13
dtype: int64

In [7]:
#another way to create a seri is to pass a Numpy array or Dictionary to it(same as creating an array by passing a list to it)
pd.Series(num)

0    11
1    12
2    13
dtype: int64

In [8]:
pd.Series(dictionary)

a    11
b    12
c    13
dtype: int64

In [9]:
#grabbing information from Series
Ser1= pd.Series([1,2,3],['A','B','C'])
Ser2= pd.Series([4,5,6],['B','C','E'])

In [10]:
#the operations are based on the indexes :
Ser1+Ser2

A    NaN
B    6.0
C    8.0
E    NaN
dtype: float64

In [44]:
# ............................................ Data Frames .................................
# Data Frames are the main tool while working with Pandas in Data Frames we have Rows and Columns, and each column is a 
# Pandas Series :
from numpy.random import  randn
np.random.seed(100)
dataf= pd.DataFrame(randn(4,3), ['A','B','C','D'], ['L','M','N'])
dataf

          L         M         N
A -1.749765  0.342680  1.153036
B -0.252436  0.981321  0.514219
C  0.221180 -1.070043 -0.189496
D  0.255001 -0.458027  0.435163

In [4]:
#to grb info from Data Frame :
dataf['M']

A    0.342680
B    0.981321
C   -1.070043
D   -0.458027
Name: M, dtype: float64

In [5]:
#infact Roes and Columns in a Dataframe are Series
type(dataf['M'])

pandas.core.series.Series

In [14]:
#you can also grab a multiple columns by passing a list of column names:
dataf[['L','N']]

          L         N
A  0.371646  1.829760
B -0.042402  1.024389
C  1.718637  0.571888
D -0.534978 -1.553557

In [6]:
#to create a new Column to a Data Frame :
dataf['NEW']=[1,2,3,4]
dataf

          L         M         N  NEW
A -1.749765  0.342680  1.153036    1
B -0.252436  0.981321  0.514219    2
C  0.221180 -1.070043 -0.189496    3
D  0.255001 -0.458027  0.435163    4

In [7]:
#to remove a column you can use drop and pass in the actual column name, you should also give it the axis which is
# by default 0 (and is pointing to the lables or Rows, so for droping columns we should specify it):
dataf.drop('NEW', axis=1)

          L         M         N
A -1.749765  0.342680  1.153036
B -0.252436  0.981321  0.514219
C  0.221180 -1.070043 -0.189496
D  0.255001 -0.458027  0.435163

In [8]:
# ******* drop is that it is not inplace *********
dataf

          L         M         N  NEW
A -1.749765  0.342680  1.153036    1
B -0.252436  0.981321  0.514219    2
C  0.221180 -1.070043 -0.189496    3
D  0.255001 -0.458027  0.435163    4

In [9]:
#So we still need to specifies the inplace argument to be TRUE :
dataf.drop('NEW', axis=1 , inplace=True)

In [10]:
dataf

          L         M         N
A -1.749765  0.342680  1.153036
B -0.252436  0.981321  0.514219
C  0.221180 -1.070043 -0.189496
D  0.255001 -0.458027  0.435163

In [11]:
# How to grab ROWS in DataFrames?
# there are 2 ways rto do so and for both ways you need methods:
#  1. loc (it takes a lable ) 
#  2. iloc(this one is based on the index positions)
dataf.loc['A']

L   -1.749765
M    0.342680
N    1.153036
Name: A, dtype: float64

In [12]:
dataf.iloc[0]

L   -1.749765
M    0.342680
N    1.153036
Name: A, dtype: float64

In [13]:
# For selecting subset of Rows and Columns fo a Dataframe we aso need to use loc:
dataf.loc[['A','B'],'N']

A    1.153036
B    0.514219
Name: N, dtype: float64

In [24]:
#conditional selection in Dataframes 
dataf>0

       L      M      N
A  False   True   True
B  False   True   True
C   True  False  False
D   True  False   True

In [25]:
#as like arrays we can pass the boolean result of a conditional selection to the main data frame and retrieve the main values 
dataf[dataf>=0]

          L         M         N
A       NaN  0.342680  1.153036
B       NaN  0.981321  0.514219
C  0.221180       NaN       NaN
D  0.255001       NaN  0.435163

In [26]:
#salecting columns and rows in a conditional selection
dataf[dataf>=0][['M','N']]

          M         N
A  0.342680  1.153036
B  0.981321  0.514219
C       NaN       NaN
D       NaN  0.435163

In [29]:
dataf[dataf['M']>=0].loc['A']

L   -1.749765
M    0.342680
N    1.153036
Name: A, dtype: float64

In [33]:
#Multiple Condition for AND we should use & and for OR we use | in Python 
dataf[(dataf['M']>0) & (dataf['L']<0)]

          L         M         N
A -1.749765  0.342680  1.153036
B -0.252436  0.981321  0.514219

In [45]:
# if we want to reset the index back to the default rage [0,1,2,...] this way we can change the default index of a Dataframe:
dataf.reset_index()

  index         L         M         N
0     A -1.749765  0.342680  1.153036
1     B -0.252436  0.981321  0.514219
2     C  0.221180 -1.070043 -0.189496
3     D  0.255001 -0.458027  0.435163

In [46]:
#this method is not inplace you can also set any column as an index : 
dataf['NewIndex']=['A1','B1','C1','D1']
dataf

          L         M         N NewIndex
A -1.749765  0.342680  1.153036       A1
B -0.252436  0.981321  0.514219       B1
C  0.221180 -1.070043 -0.189496       C1
D  0.255001 -0.458027  0.435163       D1

In [47]:
dataf.set_index('NewIndex')

                 L         M         N
NewIndex
A1       -1.749765  0.342680  1.153036
B1       -0.252436  0.981321  0.514219
C1        0.221180 -1.070043 -0.189496
D1        0.255001 -0.458027  0.435163

In [48]:
dataf

          L         M         N NewIndex
A -1.749765  0.342680  1.153036       A1
B -0.252436  0.981321  0.514219       B1
C  0.221180 -1.070043 -0.189496       C1
D  0.255001 -0.458027  0.435163       D1

In [49]:
# now we drop the extra column 
dataf.drop('NewIndex',axis=1, inplace=True)
dataf

          L         M         N
A -1.749765  0.342680  1.153036
B -0.252436  0.981321  0.514219
C  0.221180 -1.070043 -0.189496
D  0.255001 -0.458027  0.435163

In [51]:
# .................. Multilevel indexing in Dataframe ..........................
df=pd.DataFrame(randn(5,5),['A','B','C','D','F'],['U','V','W','X','Y'])
df

          U         V         W         X         Y
A -1.690617 -1.356399 -1.232435 -0.544439 -0.668172
B  0.007315 -0.612939  1.299748 -1.733096 -0.983310
C  0.357508 -1.613579  1.470714 -1.188018 -0.549746
D -0.940046 -0.827932  0.108863  0.507810 -0.862227
F  1.249470 -0.079611 -0.889731 -0.881798  0.018639

In [52]:
#Index Levels
outside = ['R1','R1','R1','F1','F1','F1']
inside = [1,2,3,1,2,3]
hier_index= list(zip(outside,inside))
hier_index= pd.MultiIndex.from_tuples(hier_index)

In [54]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
R1 1  2.034608 -0.550714
   2  0.750453 -1.306992
   3  0.580573 -1.104523
F1 1  0.690121  0.686890
   2 -1.566688  0.904974
   3  0.778822  0.428233

In [55]:
#giving the lables (like R1,F1 and [1,2,3] ) a name
df.index.names=['Family','Members']
df

                       A         B
Family Members
R1     1        2.034608 -0.550714
       2        0.750453 -1.306992
       3        0.580573 -1.104523
F1     1        0.690121  0.686890
       2       -1.566688  0.904974
       3        0.778822  0.428233

In [63]:
df.index.names

FrozenList(['Family', 'Members'])

In [64]:
df['A']

Family  Members
R1      1          2.034608
        2          0.750453
        3          0.580573
F1      1          0.690121
        2         -1.566688
        3          0.778822
Name: A, dtype: float64

In [65]:
#Value selection in multilevel dataframes,the idea is to call from outside index and continue calling incide deeper :
df.loc['R1']

                A         B
Members
1        2.034608 -0.550714
2        0.750453 -1.306992
3        0.580573 -1.104523

In [66]:
df.loc['R1'].loc[1]

A    2.034608
B   -0.550714
Name: 1, dtype: float64

In [67]:
df.loc['R1'].loc[1].loc['B']

-0.5507144119145928

In [71]:
#Another method which can go inside the DF and it can be more easy in comparison with .loc() method, this method is 
# cross-section and is call xs() used for multi-level index when we want to grab from inside indexes, you only need to
# pass the nme of the Name of the index in the level.
df.xs(1,level='Members')

               A         B
Family
R1      2.034608 -0.550714
F1      0.690121  0.686890